# NumberOfSplitRegions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..NumberOfSplitRegions Property
ViewCropRegionShapeManager Class See Also
---
The number of split crop regions (1 if the crop is not currently split).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int NumberOfSplitRegions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSplitRegions As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSplitRegions {
	int get ();
}
```

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace